# Напишите функцию для транспонирования матрицы

my_matrix = [[ 1, 2],[ 4, 5], [3, 6]]

print([list(x) for x in zip(*my_matrix)])
